       IDENTIFICATION DIVISION.
       PROGRAM-ID. GetSum.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNum1 PIC 9 VALUE 3.
       01 LNUM2 PIC 9 VALUE 5.
       01 LSUM1 PIC 9(2).

       PROCEDURE DIVISION USING LNUM1, LNUM2, LSUM1.
           COMPUTE LSUM1 = LNUM1 + LNUM2.
       
           EXIT PROGRAM.
           